In [1]:
#Import des librairies Python
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as st
import math as mth

# Mission1

In [2]:
#Import des fichiers csv extraits directement de la base de données de l’entreprise
df_transactions = pd.read_csv('transactions.csv') 
df_products = pd.read_csv('products.csv') 
df_customers = pd.read_csv('customers.csv')

In [3]:
df_transactions

       id_prod                        date session_id client_id
0       0_1483  2021-04-10 18:37:28.723910    s_18746    c_4450
1        2_226  2022-02-03 01:55:53.276402   s_159142     c_277
2        1_374  2021-09-23 15:13:46.938559    s_94290    c_4270
3       0_2186  2021-10-17 03:27:18.783634   s_105936    c_4597
4       0_1351  2021-07-17 20:34:25.800563    s_63642    c_1242
...        ...                         ...        ...       ...
337011   1_671  2021-05-28 12:35:46.214839    s_40720    c_3454
337012   0_759  2021-06-19 00:19:23.917703    s_50568    c_6268
337013  0_1256  2021-03-16 17:31:59.442007     s_7219    c_4137
337014   2_227  2021-10-30 16:50:15.997750   s_112349       c_5
337015  0_1417  2021-06-26 14:38:19.732946    s_54117    c_6714

[337016 rows x 4 columns]

In [4]:
df_products

     id_prod   price  categ
0     0_1421   19.99      0
1     0_1368    5.13      0
2      0_731   17.99      0
3      1_587    4.99      1
4     0_1507    3.99      0
...      ...     ...    ...
3282    2_23  115.99      2
3283   0_146   17.14      0
3284   0_802   11.22      0
3285   1_140   38.56      1
3286  0_1920   25.16      0

[3287 rows x 3 columns]

In [5]:
df_customers

     client_id sex  birth
0       c_4410   f   1967
1       c_7839   f   1975
2       c_1699   f   1984
3       c_5961   f   1962
4       c_5320   m   1943
...        ...  ..    ...
8618    c_7920   m   1956
8619    c_7403   f   1970
8620    c_5119   m   1974
8621    c_5643   f   1968
8622      c_84   f   1982

[8623 rows x 3 columns]

#Nettoyage de données

In [6]:
df_transactions.isnull()

        id_prod   date  session_id  client_id
0         False  False       False      False
1         False  False       False      False
2         False  False       False      False
3         False  False       False      False
4         False  False       False      False
...         ...    ...         ...        ...
337011    False  False       False      False
337012    False  False       False      False
337013    False  False       False      False
337014    False  False       False      False
337015    False  False       False      False

[337016 rows x 4 columns]

In [7]:
df_products.isnull()

      id_prod  price  categ
0       False  False  False
1       False  False  False
2       False  False  False
3       False  False  False
4       False  False  False
...       ...    ...    ...
3282    False  False  False
3283    False  False  False
3284    False  False  False
3285    False  False  False
3286    False  False  False

[3287 rows x 3 columns]

In [8]:
df_customers.isnull()

      client_id    sex  birth
0         False  False  False
1         False  False  False
2         False  False  False
3         False  False  False
4         False  False  False
...         ...    ...    ...
8618      False  False  False
8619      False  False  False
8620      False  False  False
8621      False  False  False
8622      False  False  False

[8623 rows x 3 columns]

In [9]:
#Traitement des valeurs aberrantes 
#Tri rapide sur les 5 premières lignes du dataframe df_product (méthode .sort_values())
df_products.sort_values('id_prod', ascending = False).head()

     id_prod   price  categ
731      T_0   -1.00      0
3188    2_99   84.99      2
3088    2_98  149.74      2
2698    2_97  160.99      2
2576    2_96   47.91      2

In [10]:
#Tri rapide sur les 5 premières lignes du dataframe df_product (méthode .sort_values())
df_products.sort_values('id_prod', ascending = False).tail()

     id_prod  price  categ
922   0_1000   6.84      0
663    0_100  20.60      0
2691    0_10  17.95      0
803      0_1  10.99      0
1001     0_0   3.75      0

In [11]:
#Suppression de la ligne index 731, la valeur n'a aucune signification logique
df_products = df_products[df_products.id_prod != 'T_0']

In [12]:
df_customers.sort_values('client_id',ascending=False).head()

     client_id sex  birth
8494      ct_1   m   2001
2735      ct_0   f   2001
7358     c_999   m   1964
2145     c_998   m   2001
94       c_997   f   1994

In [13]:
df_customers.sort_values('client_id',ascending=False).tail()

     client_id sex  birth
3426    c_1001   m   1982
8472    c_1000   f   1966
2137     c_100   m   1992
6894      c_10   m   1956
4299       c_1   m   1955

In [14]:
ct_0 = df_customers.loc[df_customers['client_id'] == 'ct_0']
ct_1 = df_customers.loc[df_customers['client_id'] == 'ct_1']
print(ct_0)
print(ct_1)

     client_id sex  birth
2735      ct_0   f   2001
     client_id sex  birth
8494      ct_1   m   2001

In [15]:
#On supprime ces deux valeurs en utilisant la méthode .drop().
df_customers.drop([2735, 8494], 0, inplace=True)
df_customers.sort_values('client_id')

     client_id sex  birth
4299       c_1   m   1955
6894      c_10   m   1956
2137     c_100   m   1992
8472    c_1000   f   1966
3426    c_1001   m   1982
...        ...  ..    ...
7004     c_995   m   1955
2788     c_996   f   1970
94       c_997   f   1994
2145     c_998   m   2001
7358     c_999   m   1964

[8621 rows x 3 columns]

In [16]:
df_transactions.sort_values('client_id',ascending=False).head()

       id_prod                             date session_id client_id
298399     T_0  test_2021-03-01 02:30:02.237423        s_0      ct_1
57261      T_0  test_2021-03-01 02:30:02.237439        s_0      ct_1
77758      T_0  test_2021-03-01 02:30:02.237429        s_0      ct_1
2895       T_0  test_2021-03-01 02:30:02.237414        s_0      ct_1
250656     T_0  test_2021-03-01 02:30:02.237431        s_0      ct_1

In [17]:
df_transactions.sort_values('client_id',ascending=False).tail()

       id_prod                        date session_id client_id
83342   0_1429  2021-10-15 11:28:24.523566   s_105105       c_1
321196  0_1547  2021-09-08 08:27:49.586711    s_86739       c_1
298829  0_1090  2021-12-19 02:44:12.827475   s_136532       c_1
28406    1_713  2021-11-15 20:40:00.586010   s_120172       c_1
126857  0_1571  2022-02-01 01:47:04.355850   s_158128       c_1

In [18]:
#Suppression des valeurs test
df_transactions = df_transactions[df_transactions.id_prod != 'T_0']

In [19]:
df_transactions.dtypes

id_prod       object
date          object
session_id    object
client_id     object
dtype: object

In [20]:
df_transactions.date = pd.to_datetime(df_transactions.date).copy()

C:\Users\33753\anaconda3\lib\site-packages\pandas\core\generic.py:5494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [21]:
df_transactions.dtypes

id_prod               object
date          datetime64[ns]
session_id            object
client_id             object
dtype: object

In [22]:

#Vérification des éventuelles valeurs manquantes
df_transactions.date.isnull().sum()

0

In [23]:
#Méthode .duplicated() pour identifier la présence de doublons
print(df_products.duplicated().sum())
print(df_customers.duplicated().sum())
print(df_transactions.duplicated().sum())

0
0
0

In [24]:
df100 = pd.merge(df_transactions,df_customers, on='client_id')
df100 = pd.merge(df100, df_products, on = 'id_prod')
df100['count'] = 1
df100 = df100.groupby('client_id').sum().reset_index()
df100 = df100.sort_values('count', ascending=False)
df100 = df100[['client_id', 'count']]
df100 = pd.merge(df100, df_customers, on='client_id')
df100 = df100.sort_values('count', ascending=False)
top_5 = df100.iloc[0:5]

In [25]:
# on peut apercevoir 4 outliers qui se distinguent
print(top_5)

  client_id  count sex  birth
0    c_1609  12855   m   1980
1    c_6714   4471   f   1968
2    c_3454   3273   m   1969
3    c_4958   2562   m   1999
4    c_7959    195   f   1974

In [26]:
mask = df_transactions.loc[(df_transactions['client_id'] == 'c_1609') | (df_transactions['client_id'] =='c_6714') | (df_transactions['client_id'] =='c_3454') | (df_transactions['client_id'] =='c_4958')]
outliers = mask.index.tolist()
df_transactions = df_transactions.drop(outliers)

In [27]:
df_transactions_products=pd.merge(df_transactions,df_products ,on='id_prod', how='left')

In [28]:
#cree un dataframe uniquement ou il ya des nan
df_missing_values = df_transactions_products[df_transactions_products.categ.isnull() == True]

In [29]:
#reperer ou il y a une valeur manquante
df_missing_values.id_prod.unique()

array(['0_2245'], dtype=object)

In [30]:
df_transactions_products['price'] = df_transactions_products.price.fillna(df_transactions_products.price.mean())

In [31]:
#Le produit id 0_2245 doit-être classifié en catégorie 0
df_transactions_products['categ'] = df_transactions_products.categ.fillna(0)

In [32]:
df_transactions_products[df_transactions_products.date.isnull() == True]

Empty DataFrame
Columns: [id_prod, date, session_id, client_id, price, categ]
Index: []

In [33]:
df_transactions_products.isnull().sum()

id_prod       0
date          0
session_id    0
client_id     0
price         0
categ         0
dtype: int64